p_bendPipe/sBend/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-05;
        relTol          0.001;
    }
    pFinal
    {
        $p;
        relTol          0;
    }
	
    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }
    "(U|k|omega)Final"
    {
        $U;
        relTol          0;
    }

    Phi
    {
	solver		GAMG;
	smoother	DIC;
	tolerance	1e-05;
	relTol		0.01;
    }

}


PIMPLE
{
    nOuterCorrectors		50;
    nCorrectors			3;
    nNonOrthogonalCorrectors	2;	

    relaxationFactors
    {
	fields
	{
		p	0.5;
		pFinal	1;
	}
	equations
	{
		"U|k|epsilon|omega|R|nuTilda"		0.5;
		"(U|k|epsilon|omega|R|nuTilda)Final"	1;
	}
    }

    residualControl
    {
	U
	{
	    tolerance		5e-4;
	    relTol		0;
	}
	p
	{
	    tolerance		1e-3;
	    relTol		0;
	}
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 3;
}

// ************************************************************************* //
