p_bendPipe/sBend/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet.obj
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}
outlet.obj
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}
wall.obj
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}
// ************************************************************************* //
